{
    "TIGER": [
        "The range of a male [______] overlaps with that of multiple females with whom he mates.",
        "The [______] is an apex predator and preys mainly on ungulates, which it takes by ambush.",
        "Throughout the [______]'s range, it inhabits mainly forests, from coniferous and temperate broadleaf and mixed forests in the Russian Far East and Northeast China to tropical and subtropical moist broadleaf forests on the Indian subcontinent and Southeast Asia.",
        "It is traditionally classified into nine recent subspecies, though some recognise only two subspecies, mainland Asian [______]s and the island [______]s of the Sunda Islands.",
        "The [______] (Panthera tigris) is a large cat and a member of the genus Panthera native to Asia."
    ],
    "ZEBRA": [
        "[______] stripes come in different patterns, unique to each individual.",
        "[______]s share the genus Equus with horses and asses, the three groups being the only living members of the family Equidae.",
        "quagga), and the mountain [______] (E.",
        "There are three living species: Grévy's [______] (Equus grevyi), the plains [______] (E.",
        "[______]s (US: , UK: ) (subgenus Hippotigris) are African equines with distinctive black-and-white striped coats."
    ],
    "HORSE": [
        "These feral populations are not true wild [______]s, which are [______]s that have never been domesticated.",
        "[______]s in the subspecies caballus are domesticated, although some domesticated populations live in the wild as feral [______]s.",
        "Humans began domesticating [______]s around 4000 BCE in Central Asia, and their domestication is believed to have been widespread by 3000 BCE.",
        "The [______] has evolved over the past 45 to 55 million years from a small multi-toed creature, Eohippus, into the large single-toed animal of today, originally in North America.",
        "The [______] (Equus ferus caballus) is a domesticated, one-toed, hoofed mammal."
    ],
    "EAGLE": [
        "  == Etymology == The word \"[______]\" is borrowed into English from Old French aigle, ultimately from Latin aquila.",
        "[______]s are not a natural group but denote essentially any kind of bird of prey large enough to hunt sizeable (about 50 cm long or more overall) vertebrates.",
        "Most of the 68 species of [______]s are from Eurasia and Africa.",
        "While on a genetic level, only the subfamily Aquilinae comprises \"true [______]s\", many other species are commonly referred to as [______]s, such as the bald [______], and the term generally carries no taxonomic weight.",
        "[______] is the common name for certain large birds of prey within the family of the Accipitridae."
    ],
    "SHARK": [
        "The earliest confirmed modern [______]s (Selachii) are known from the Early Jurassic around 200 million years ago, with the oldest known member being Agaleus, though records of true [______]s may extend back as far as the Permian.",
        "[______]-like chondrichthyans such as Cladoselache and Doliodus first appeared in the Devonian Period (419–359 million years), though some fossilized chondrichthyan-like scales are as old as the Late Ordovician (458–444 million years ago).",
        "Some sources extend the term \"[______]\" as an informal category including extinct members of Chondrichthyes (cartilaginous fish) with a [______]-like morphology, such as hybodonts.",
        "Modern [______]s are classified within the division Selachii and are the sister group to the Batomorphi (rays and skates).",
        "[______]s are a group of elasmobranch cartilaginous fishes characterized by a ribless endoskeleton, dermal denticles, five to seven gill slits on each side, and pectoral fins that are not fused to the head."
    ],
    "WHALE": [
        "Mysticetes include four extant (living) families: Balaenopteridae (the rorquals), Balaenidae (right [______]s), Cetotheriidae (the pygmy right [______]), and Eschrichtiidae (the grey [______]).",
        "The two parvorders of [______]s, baleen [______]s (Mysticeti) and toothed [______]s (Odontoceti), are thought to have had their last common ancestor around 34 million years ago.",
        "[______]s, dolphins and porpoises belong to the order Cetartiodactyla, which consists of even-toed ungulates.",
        "Dolphins and porpoises may be considered [______]s from a formal, cladistic perspective.",
        "[______]s are a widely distributed and diverse group of fully aquatic placental marine mammals."
    ],
    "SNAKE": [
        "These resemble [______]s, but several common groups of legless lizards have eyelids and external ears, which [______]s lack, although this rule is not universal (see Amphisbaenia, Dibamidae, and Pygopodidae).",
        "To accommodate their narrow bodies, [______]s' paired organs (such as kidneys) appear one in front of the other instead of side by side, and most only have one functional lung.",
        "Many species of [______]s have skulls with several more joints than their lizard ancestors and relatives, enabling them to swallow prey much larger than their heads (cranial kinesis).",
        "Cladistically squamates, [______]s are ectothermic, amniote vertebrates covered in overlapping scales much like other members of the group.",
        "[______]s are elongated limbless reptiles of the suborder Serpentes ()."
    ],
    "SHEEP": [
        "An adult female is referred to as a ewe ( yoo), an intact male as a ram, occasionally a tup, a castrated male as a wether, and a young [______] as a lamb.",
        "Numbering a little over one billion, domestic [______] are also the most numerous species of [______].",
        "Like all ruminants, [______] are members of the order Artiodactyla, the even-toed ungulates.",
        "Although the term [______] can apply to other species in the genus Ovis, in everyday usage it almost always refers to domesticated [______].",
        "[______] (pl.: [______]) or domestic [______]  (Ovis aries) are a domesticated, ruminant mammal typically kept as livestock."
    ],
    "CAMEL": [
        "The one-humped dromedary makes up 94% of the world's [______] population, and the two-humped Bactrian [______] makes up 6%.",
        "There are three surviving species of [______].",
        "[______]s are working animals especially suited to their desert habitat and are a vital means of transport for passengers and cargo.",
        "[______]s have long been domesticated and, as livestock, they provide food ([______] milk and meat) and textiles (fiber and felt from [______] hair).",
        "A [______] (from Latin: [______]us and Ancient Greek: κάμηλος (kamēlos) from Ancient Semitic: gāmāl) is an even-toed ungulate in the genus [______]us that bears distinctive fatty deposits known as \"humps\" on its back."
    ],
    "KOALA": [
        "[______]s typically inhabit open Eucalyptus woodland, as the leaves of these trees make up most of their diet.",
        "[______]s from the northern populations are typically smaller and lighter in colour than their counterparts further south.",
        "The [______] has a body length of 60–85 cm (24–33 in) and weighs 4–15 kg (8.8–33.1 lb).",
        "The [______] is found in coastal areas of the continent's eastern and southern regions, inhabiting Queensland, New South Wales, Victoria, and South Australia.",
        "The [______] (Phascolarctos cinereus), sometimes inaccurately called the [______] bear, is an arboreal herbivorous marsupial native to Australia."
    ],
    "MOUSE": [
        "Typical mice are classified in the genus Mus, but the term [______] is not confined to members of Mus and can also apply to species from other genera such as the deer [______] (Peromyscus).",
        "The common terms rat and [______] are not taxonomically specific.",
        "Generally, when a muroid rodent is discovered, its common name includes the term [______] if it is smaller, or rat if it is larger.",
        "The best known [______] species is the common house [______] (Mus musculus).",
        "A [______] (pl.: mice) is a small rodent."
    ],
    "MOOSE": [
        "Prior to the early modern period (around 1600–1700), [______] were one of many valuable sources of sustenance for certain North American Indians.",
        "Hunting shaped the relationship between [______] and humans, both in Eurasia and North America.",
        "[______] inhabit the circumpolar boreal forests or temperate broadleaf and mixed forests of the Northern Hemisphere, thriving in cooler, temperate areas as well as subarctic climates.",
        "Most adult male [______] have broad, palmate (\"open-hand shaped\") antlers; other members of the deer family have pointed antlers with a dendritic (\"twig-like\") configuration.",
        "The [______] (pl.: '[______]'; used in North America) or elk (pl.: 'elk' or 'elks'; used in Eurasia) (Alces alces) is the world's tallest, largest and heaviest extant species of deer and the only species in the genus Alces."
    ],
    "OTTER": [
        " There are 14 known species of [______]s, ranging in size and habitat preferences, with some species adapted to cold waters requiring a high metabolic rate for warmth.",
        "[______]s exhibit a varied life cycle with a gestation period of about 60–86 days, and offspring typically stay with their family for a year.",
        "[______]s are distinguished by their long, slim bodies, powerful webbed feet for swimming, and their dense fur, which keeps them warm and buoyant in water.",
        "The 14 extant [______] species are all semiaquatic, both freshwater and marine.",
        "[______]s are carnivorous mammals in the subfamily Lutrinae."
    ],
    "LEMUR": [
        "Living [______]s range in weight from the 30-gram (1.1 oz) mouse [______] to the 9-kilogram (20 lb) indri.",
        "Due to Madagascar’s highly seasonal climate, [______] evolution has produced a level of species diversity rivaling that of any other primate group.",
        " [______]s share resemblance with other primates, but evolved independently from monkeys and apes.",
        "Most existing [______]s are small, with a pointed snout, large eyes, and a long tail.",
        "[______]s (  LEE-mərz; from Latin  [______]ēs 'ghosts, spirits of the dead') are wet-nosed primates of the superfamily [______]oidea ( LEM-yuu-ROY-dee-ə), divided into eight families and consisting of 15 genera and around 100 extant species."
    ],
    "STORK": [
        "Various terms are used to refer to groups of [______]s, two frequently used ones being a muster of [______]s and a phalanx of [______]s.",
        "There are 20 living species of [______]s in six genera.",
        "Most [______]s eat frogs, fish, insects, earthworms, small birds and small mammals.",
        " [______]s dwell in many regions and tend to live in drier habitats than the closely related herons, spoonbills and ibises; they also lack the powder down that those groups use to clean off fish slime.",
        "[______]s are large, long-legged, long-necked wading birds with long, stout bills."
    ],
    "HERON": [
        "The classification of the individual [______]/egret species is fraught with difficulty, and no clear consensus exists about the correct placement of many species into either of the two major genera, Ardea and Egretta.",
        "[______]s, by evolutionary adaptation, have long beaks.",
        "Egrets do not form a biologically distinct group from [______]s, and tend to be named differently because they are mainly white or have decorative plumes in breeding plumage.",
        "Members of the genus Botaurus are referred to as bitterns, and, together with the zigzag [______], or zigzag bittern, in the monotypic genus Zebrilus, form a monophyletic group within the Ardeidae.",
        "[______]s are long-legged, long-necked, freshwater and coastal birds in the family Ardeidae, with 75 recognised species, some of which are referred to as egrets or bitterns rather than [______]s."
    ],
    "BISON": [
        "[______], and the generally more northern wood [______], B.",
        "The North American species is composed of two subspecies, the Plains [______], B.",
        "[______], found only in North America, is the more numerous.",
        "  Of the two surviving species, the American [______], B.",
        "A [______] (pl.: [______]) is a large bovine in the genus [______] (from Greek, meaning 'wild ox') within the tribe Bovini."
    ],
    "CRANE": [
        "Some species and populations of [______]s migrate over long distances; others do not migrate at all.",
        "[______]s live on most continents, with the exception of Antarctica and South America.",
        "[______]s fly with their necks extended outwards instead of bent into an S-shape and their long legs outstretched.",
        "Most species have muted gray or white plumages, marked with black, and red bare patches on the face, but the crowned [______]s of the genus Balearica have vibrantly-coloured wings and golden \"crowns\" of feathers.",
        "[______]s are a type of large bird with long legs and necks in the biological family Gruidae of the order Gruiformes."
    ],
    "HYENA": [
        "[______]s feature prominently in the folklore and mythology of human cultures that live alongside them.",
        "However, [______]s' grooming, scent marking, defecation habits, mating, and parental behavior are consistent with the behavior of other feliforms.",
        "Although phylogenetically closer to felines and viverrids, [______]s are behaviourally and morphologically similar to canids in several elements due to convergent evolution: both [______]s and canines are non-arboreal, cursorial hunters that catch prey with their teeth rather than claws.",
        "Despite their low diversity, [______]s are unique and vital components of most African ecosystems.",
        "[______]s or hyaenas ( hi-EE-nəz; from Ancient Greek ὕαινα, hýaina) are feliform carnivoran mammals belonging to the family Hyaenidae ()."
    ],
    "APPLE": [
        "[______]s grown from seeds tend to be very different from those of their parents, and the resultant fruit frequently lacks desired characteristics.",
        "[______]s have cultural significance in many mythologies (including Norse and Greek) and religions (such as Christianity in Europe).",
        "[______]s have been grown for thousands of years in Eurasia before they were introduced to North America by European colonists.",
        "Fruit trees of the orchard or domestic [______] (Malus domestica), the most widely grown in the genus, are cultivated worldwide.",
        "An [______] is the round, edible fruit of an [______] tree (Malus spp.)."
    ],
    "BREAD": [
        "In many countries, mass-produced [______] often contains additives to improve flavor, texture, color, shelf life, nutrition, and ease of production.",
        "[______] may also be unleavened.",
        "baking soda), industrially produced yeast, or high-pressure aeration, which creates the gas bubbles that fluff up [______].",
        "[______] may be leavened by naturally occurring microbes (e.g.",
        "[______] is a baked food product made from water, flour, and often yeast."
    ],
    "PIZZA": [
        "In 2017, the art of making Neapolitan [______] was included on UNESCO's list of intangible cultural heritage.",
        "In 2009, Neapolitan [______] was registered with the European Union as a traditional speciality guaranteed (TSG) dish.",
        "Raffaele Esposito is often credited for creating the modern [______] in Naples.",
        "The term [______] was first recorded in 997 AD, in a Latin manuscript from the southern Italian town of Gaeta, in Lazio, on the border with Campania.",
        "[______] is an Italian dish typically consisting of a flat base of leavened wheat-based dough topped with tomato, cheese, and other ingredients, baked at a high temperature, traditionally in a wood-fired oven."
    ],
    "FRUIT": [
        "In common language and culinary usage, [______] normally means the seed-associated fleshy structures (or produce) of plants that typically are sweet (or sour) and edible in the raw state, such as apples, bananas, grapes, lemons, oranges, and strawberries.",
        "Consequently, [______]s account for a substantial fraction of the world's agricultural output, and some (such as the apple and the pomegranate) have acquired extensive cultural and symbolic meanings.",
        "Edible [______]s in particular have long propagated using the movements of humans and other animals in a symbiotic relationship that is the means for seed dispersal for the one group and nutrition for the other; humans, and many other animals, have become dependent on [______]s as a source of food.",
        "[______]s are the means by which angiosperms disseminate their seeds.",
        "In botany, a [______] is the seed-bearing structure in flowering plants (angiosperms) that is formed from the ovary after flowering."
    ],
    "GRAPE": [
        "Other [______]-derived products include various types of jam, juice, vinegar and oil.",
        "Eaten fresh or in dried form (as raisins, currants and sultanas), [______]s also hold cultural significance in many parts of the world, particularly for their role in winemaking.",
        "The cultivation of [______]s began approximately 8,000 years ago, and the fruit has been used as human food throughout its history.",
        "[______]s are a non-climacteric type of fruit, generally occurring in clusters.",
        "A [______] is a fruit, botanically a berry, of the deciduous woody vines of the flowering plant genus Vitis."
    ],
    "LEMON": [
        "The yellow fruit of the [______] tree is used throughout the world, primarily for its juice.",
        "Some other citrus fruits are called [______].",
        "Its origins are uncertain, but some evidence suggests [______]s originated during the 1st millennium BC in what is now northeastern India.",
        "A true [______] is a hybrid of the citron and the bitter orange.",
        "The [______] (Citrus × limon) is a species of small evergreen tree in the Citrus genus of the flowering plant family Rutaceae."
    ],
    "MELON": [
        "The word [______] derives from Latin melopepo, which is the latinization of the Greek μηλοπέπων (mēlopepōn), meaning \"[______]\", itself a compound of μῆλον (mēlon), \"apple\", treefruit (of any kind)\" and πέπων (pepōn), amongst others \"a kind of gourd or [______]\".",
        "Botanically, a [______] is a kind of berry, specifically a \"pepo\".",
        "The term \"[______]\" can apply to both the plant and its fruit.",
        "It can also specifically refer to Cucumis melo, commonly known as the \"true [______]\" or simply \"[______]\".",
        "A [______] is any of various plants of the family Cucurbitaceae with sweet, edible, and fleshy fruit."
    ],
    "ONION": [
        "The name wild [______] is applied to a number of Allium species, but A.",
        "The genus contains several other species variously called [______]s and cultivated for food, such as the Japanese bunching [______] Allium fistulosum, the tree [______] Allium × proliferum, and the Canada [______] Allium canadense.",
        "The [______]'s close relatives include garlic, scallion, leek, and chives.",
        "The shallot is a botanical variety of the [______] which was classified as a separate species until 2011.",
        "The [______] (Allium cepa L.Tooltip Carl Linnaeus, from Latin cepa), also known as the bulb [______] or common [______], is a vegetable that is the most widely cultivated species of the genus Allium."
    ],
    "SUGAR": [
        "During digestion, compound [______]s are hydrolysed into simple [______]s.",
        "White [______] is almost pure sucrose.",
        "Compound [______]s, also called disaccharides or double [______]s, are molecules made of two bonded monosaccharides; common examples are sucrose (glucose + fructose), lactose (glucose + galactose), and maltose (two molecules of glucose).",
        "Simple [______]s, also called monosaccharides, include glucose, fructose, and galactose.",
        "[______] is the generic name for sweet-tasting, soluble carbohydrates, many of which are used in food."
    ],
    "CREAM": [
        "In many countries partially fermented [______] is also sold as: sour [______], crème fraîche, and so on.",
        "Whey [______] has a lower fat content and tastes more salty, tangy, and \"cheesy\".",
        "[______] skimmed from milk may be called \"sweet [______]\" to distinguish it from [______] skimmed from whey, a by-product of cheese-making.",
        "In the industrial production of [______], this process is accelerated by using centrifuges called \"separators\".",
        "[______] is a dairy product composed of the higher-fat layer skimmed from the top of milk before homogenization."
    ],
    "CANDY": [
        "Each culture has its own ideas of what constitutes [______] rather than dessert.",
        "However, the definition of [______] also depends upon how people treat the food.",
        "Physically, [______] is characterized by the use of a significant amount of sugar or sugar substitutes.",
        "The category, also called sugar confectionery, encompasses any sweet confection, including chocolate, chewing gum, and sugar [______].",
        "[______], also commonly called sweets, is a confection that features sugar as a principal ingredient."
    ],
    "STEAK": [
        "Grilled portobello mushroom may be called mushroom [______], and similarly for other vegetarian dishes.",
        "Some cuts are categorized as [______]s not because they are cut across the muscle fibers, but because they are relatively thin and cooked over a grill, such as skirt [______] and flank [______].",
        "Some cured meat, such as gammon, is commonly served as [______].",
        "[______]s are most commonly cut from cattle (beef[______]), but can also be cut from bison, buffalo, camel, goat, horse, kangaroo, sheep, ostrich, pigs, turkey, and deer, as well as various types of fish, especially salmon and large fish such as swordfish, shark, and marlin.",
        "A [______] is a cut of meat sliced across muscle fibers, sometimes including a bone."
    ],
    "BACON": [
        "[______] is cured through either a process of injecting it with or soaking it in brine, known as wet curing, or rubbed with salt, known as dry curing.",
        "Vegetarian [______]s such as \"soy [______]\" also exist.",
        "  Meat from other animals, such as beef, lamb, chicken, goat, or turkey, may also be cut, cured, or otherwise prepared to resemble [______], and may even be referred to as, for example, \"turkey [______]\".",
        "[______] is also used for barding and larding roasts, especially game, including venison and pheasant, and may also be used to insulate or flavour roast joints by being layered onto the meat.",
        "[______] is a type of salt-cured pork made from various cuts, typically the belly or less fatty parts of the back."
    ],
    "TOAST": [
        "Butter or margarine, and sweet toppings, such as jam, marmalade or jelly, are commonly spread on [______].",
        "[______] may contain more acrylamide, caused by the browning process, which is suspected to be a carcinogen.",
        "Bread is commonly [______]ed using devices specifically designed for such, e.g., a [______]er or a [______]er oven.",
        "[______]ing is a common method of making stale bread more palatable.",
        "[______] is sliced bread that has been browned by radiant heat."
    ],
    "JUICE": [
        "The largest fruit [______] consumers are New Zealand (nearly a cup, or 8 ounces, each day) and Colombia (more than three quarters of a cup each day).",
        "[______] emerged as a popular beverage choice after the development of pasteurization methods enabled its preservation without using fermentation (which is used in wine production).",
        "[______] is commonly consumed as a beverage or used as an ingredient or flavoring in foods or other beverages, such as smoothies.",
        "It can also refer to liquids that are flavored with concentrate or other biological food sources like meat or seafood, such as clam [______].",
        "[______] is a drink made from the extraction or pressing of the natural liquid contained in fruit and vegetables."
    ],
    "SAUCE": [
        "[______]s need a liquid component.",
        "Possibly the oldest recorded European [______] is garum, the fish [______] used by the Ancient Romans, while doubanjiang, the Chinese soy bean paste, is mentioned in Rites of Zhou 20.",
        "[______] is a French word probably from the post-classical Latin salsa, derived from the classical salsus 'salted'.",
        "Most [______]s are not normally consumed by themselves; they add flavour, texture, and visual appeal to a dish.",
        "In cooking, a [______] is a liquid, cream, or semi-solid food, served on or used in preparing other foods."
    ],
    "PASTA": [
        "Most dried [______] is produced commercially via an extrusion process, although it can be produced at home.",
        "[______]s are divided into two broad categories: dried (Italian: [______] secca) and fresh (Italian: [______] fresca).",
        "[______] is believed to have developed independently in Italy and is a staple food of Italian cuisine, with evidence of Etruscans making [______] as early as 400 BCE in Italy.",
        "[______] was originally only made with durum, although the definition has been expanded to include alternatives for a gluten-free diet, such as rice flour, or legumes such as beans or lentils.",
        "[______] (UK: , US: ; Italian: [ˈ[______]]) is a type of food typically made from an unleavened dough of wheat flour mixed with water or eggs, and formed into sheets or other shapes, then cooked by boiling or baking."
    ],
    "SALAD": [
        "  == Etymology == The word \"[______]\" comes to English from the French [______]e of the same meaning, itself an abbreviated form of the earlier Vulgar Latin herba salata (salted herb), from the Latin salata (salted), from sal (salt).",
        "Other types of [______] include bean [______], tuna [______], bread [______]s (such as fattoush, panzanella), vegetable [______]s without leafy greens (such as Greek [______], potato [______], coleslaw), rice-, pasta- and noodle-based [______]s, fruit [______]s and dessert [______]s.",
        " Garden [______]s have a base of raw leafy greens (sometimes young \"baby\" greens) such as lettuce, arugula (rocket), kale or spinach; they are common enough that the word [______] alone often refers specifically to garden [______]s.",
        "Condiments called [______] dressings, which exist in a variety of flavors, are usually used to make a [______].",
        "A [______] is a dish consisting of mixed ingredients, frequently vegetables."
    ],
    "HONEY": [
        "[______] bees stockpile [______] in the hive.",
        "This refinement takes place both within individual bees, through regurgitation and enzymatic activity, and during storage in the hive, through water evaporation that concentrates the [______]'s sugars until it is thick and viscous.",
        "Bees produce [______] by gathering and then refining the sugary secretions of plants (primarily floral nectar) or the secretions of other insects, like the [______]dew of aphids.",
        "[______] is made and stored to nourish bee colonies.",
        "[______] is a sweet and viscous substance made by several species of bees, the best-known of which are [______] bees."
    ],
    "OLIVE": [
        "The [______] has deep historical, economic, and cultural significance in the Mediterranean.",
        "The term oil—now used to describe any viscous water-insoluble liquid—was originally synonymous with [______] oil, the liquid fat derived from [______]s.",
        "The [______] fruit is classed botanically as a drupe, similar in structure and function to the cherry or peach.",
        "The [______] is the type species for its genus, Olea, and lends its name to the Oleaceae plant family, which includes lilac, jasmine, forsythia, and ash.",
        "The [______] (botanical name Olea europaea, \"European [______]\") is a species of subtropical evergreen tree in the family Oleaceae."
    ],
    "PEACH": [
        "In 2023, China produced 65% of the world total of [______]es and nectarines.",
        "The [______] is very popular; only the apple and pear have higher production amounts for temperate fruits.",
        " [______]es were first domesticated and cultivated in China during the Neolithic period.",
        "Most are simply called [______]es, while the glossy-skinned, non-fuzzy varieties are called nectarines.",
        "The [______] (Prunus persica) is a deciduous tree that bears edible juicy fruits with various characteristics."
    ],
    "PECAN": [
        " In 1927, the National [______] Growers Association acknowledged variant pronunciations while designating one as official and correct: \"pronounced as though spelled pea-con ..",
        "  == Name == [______] derives from an Algonquian word variously referring to [______]s, walnuts, and hickory nuts.",
        "The [______] is the state nut of Alabama, Arkansas, California, Texas, and Louisiana, and is also the state tree of Texas.",
        "The seed is an edible nut used as a snack and in various recipes, such as praline candy and [______] pie.",
        "The [______] ( pih-KAN, also US:  pih-KAHN, PEE-kan, UK:  PEE-kən; Carya illinoinensis) is a species of hickory native to the Southern United States and northern Mexico in the region of the Mississippi River."
    ],
    "SPICE": [
        "They are usually classified into [______]s, [______] seeds, and herbal categories.",
        " [______]s are sometimes used in medicine, religious rituals, cosmetics, or perfume production.",
        "[______]s and herbs are both seasonings.",
        "[______]s are distinguished from herbs, which are the leaves, flowers, or stems of plants used for flavoring or as a garnish.",
        "In the culinary arts, a [______] is a seed, fruit, root, bark, or other plant substance primarily used for flavoring or coloring food."
    ],
    "WHEAT": [
        "World trade in [______] is greater than that of all other crops combined.",
        "[______] is grown on a larger area of land than any other food crop (220.7 million hectares or 545 million acres in 2021).",
        "The archaeological record suggests that [______] was first cultivated in the regions of the Fertile Crescent around 9600 BC.",
        "Well-known [______] species and hybrids include the most widely grown common [______] (T.",
        "[______] is a group of wild and domesticated grasses of the genus Triticum ()."
    ],
    "YEAST": [
        "Most [______]s reproduce asexually by mitosis, and many do so by the asymmetric division process known as budding.",
        "[______] sizes vary greatly, depending on species and environment, typically measuring 3–4 μm in diameter, although some [______]s can grow to 40 μm in size.",
        "Some [______] species have the ability to develop multicellular characteristics by forming strings of connected budding cells known as pseudohyphae or false hyphae, or quickly evolve into a multicellular cluster with specialised cell organelle functions.",
        "The first [______] originated hundreds of millions of years ago, and at least 1,500 species are currently recognized.",
        "[______]s are eukaryotic, single-celled microorganisms classified as members of the fungus kingdom."
    ],
    "FUDGE": [
        "During this period, [______] was used as an interjection by sailors to respond to nonsense or untruth.",
        "  == History ==  The term [______] is said to have originated in the 17th century from the verb [______] and means \"to fit together in a clumsy manner\".",
        "[______] is often bought as a gift from a gift shop in tourist areas and attractions.",
        "[______] can come in a variety of flavorings depending on the region or country it was made; popular flavors include fruit, nut, chocolate, and caramel.",
        "[______] is a type of confection that is made by mixing sugar, butter, and milk."
    ],
    "MANGO": [
        "Depending on the cultivar, [______] fruit varies in size, shape, sweetness, skin color, and flesh color, which may be pale yellow, gold, green, or orange.",
        "There are several hundred cultivars of [______] worldwide.",
        "Other species in the genus Mangifera also produce edible fruits called \"[______]es,\" most of which are found in the Malesian ecoregion.",
        "indica has been cultivated in South and Southeast Asia since ancient times, resulting in two modern [______] cultivars: the \"Indian\" and the \"Southeast Asian\" types.",
        "A [______] is an edible stone fruit produced by the tropical tree Mangifera indica."
    ],
    "BASIL": [
        "There are many varieties of [______] including sweet [______], Thai [______] (O.",
        "In temperate climates [______] is treated as an annual plant, but it can be grown as a short-lived perennial or biennial in warmer horticultural zones with tropical or Mediterranean climates.",
        "[______] is native to tropical regions from Central Africa to Southeast Asia.",
        "In Western cuisine, the generic term \"[______]\" refers to the variety also known as Genovese [______] or sweet [______].",
        "[______] (Ocimum [______]icum), also called great [______], is a culinary herb of the family Lamiaceae (mints)."
    ],
    "CLOVE": [
        "  == Description == The [______] tree is an evergreen that grows up to 8–12 metres (26–39 ft) tall, with large leaves and crimson flowers grouped in terminal clusters.",
        "The related English word gillyflower, originally meaning \"[______]\", derives via said Old French girofle and Latin caryophyllon, from the Greek karyophyllon \"[______]\", literally \"nut leaf\".",
        "  == Etymology == The word [______], first used in English in the 15th century, derives via Middle English clow of gilofer, Anglo-French clowes de gilofre and Old French clou de girofle, from the Latin word clavus \"nail\".",
        "[______]s are available throughout the year owing to different harvest seasons across various countries.",
        "[______]s are the aromatic flower buds of a tree in the family Myrtaceae, Syzygium aromaticum ()."
    ],
    "CURRY": [
        "Many types of [______] exist in different countries.",
        "Further exchanges around the world made [______] a fully international dish.",
        "[______] was then spread in the 19th century by indentured Indian sugar workers to the Caribbean, and by British traders to Japan.",
        "A definite step in the creation of modern [______] was the arrival in India of spicy hot chili peppers, along with other ingredients such as tomatoes and potatoes, part of the Columbian exchange of plants between the Old World and the New World.",
        "[______] is a dish with a spicy sauce or dry flavouring, initially in Indian cuisine, then modified by interchange with the Portuguese, followed by the British, and eventually thoroughly internationalised."
    ],
    "BEACH": [
        " Where wind conditions are correct, [______]es can be backed by coastal dunes which offer protection and regeneration for the [______].",
        "Erosion and changing of [______] geologies happens through natural processes, like wave action and extreme weather events.",
        "Though some [______]es form on inland freshwater locations such as lakes and rivers, most [______]es are in coastal areas where wave or current action deposits and reworks sediments.",
        "The particles composing a [______] are typically made from rock, such as sand, gravel, shingle, pebbles, etc., or biological sources, such as mollusc shells or coralline algae.",
        "A [______] is a landform alongside a body of water which consists of loose particles."
    ],
    "RIVER": [
        "[______]s flow in channeled watercourses and merge in confluences to form drainage basins, areas where surface water eventually flows to a common outlet.",
        "Water first enters [______]s through precipitation, whether from rainfall, the runoff of water down a slope, the melting of glaciers or snow, or seepage from aquifers beneath the surface of the Earth.",
        "[______]s are regulated by the water cycle, the processes by which water moves around the Earth.",
        "A [______] may run dry before reaching the end of its course if it runs out of water, or only flow during certain seasons.",
        "A [______] is a natural stream of fresh water that flows on land or inside caves towards another body of water at a lower elevation, such as an ocean, lake, or another [______]."
    ],
    "OCEAN": [
        "Horizontally the [______] covers the [______]ic crust, which it shapes.",
        "[______] scientists split the [______] into vertical and horizontal zones based on physical and biological conditions.",
        "The [______] is essential to life on Earth, harbouring most of Earth's animals and protist life, originating photosynthesis and therefore Earth's atmospheric oxygen, still supplying half of it.",
        "The [______] contains 97% of Earth's water and is the primary component of Earth's hydrosphere, acting as a huge reservoir of heat for Earth's energy budget, as well as for its carbon cycle and water cycle, forming the basis for climate and weather patterns worldwide.",
        "The [______] is the body of salt water that covers approximately 70.8% of Earth."
    ],
    "CLOUD": [
        "The World Meteorological Organization uses two methods of naming [______]s in their respective layers of the homosphere, Latin and common name.",
        "Nephology is the science of [______]s, which is undertaken in the [______] physics branch of meteorology.",
        "[______]s are seen in the Earth's homosphere, which includes the troposphere, stratosphere, and mesosphere.",
        "On Earth, [______]s are formed as a result of saturation of the air when it is cooled to its dew point, or when it gains sufficient moisture, usually in the form of water vapor, from an adjacent source to raise the dew point to the ambient temperature.",
        "In meteorology, a [______] is an aerosol consisting of a visible mass of miniature liquid droplets, ice crystals, or other particles, suspended in the atmosphere of a planetary body or similar space."
    ],
    "STORM": [
        "  == Types ==  There are many varieties and names for [______]s:  Blizzard –  There are varying definitions for blizzards, both over time and by location.",
        "This combination of opposing forces can create winds and result in the formation of [______] clouds such as cumulonimbus.",
        "[______]s are created when a center of low pressure develops with the system of high pressure surrounding it.",
        "[______]s have the potential to harm lives and property via [______] surge, heavy rain or snow causing flooding or road impassibility, lightning, wildfires, and vertical and horizontal wind shear.",
        "A [______] is any disturbed state of the natural environment or the atmosphere of an astronomical body."
    ],
    "GRASS": [
        "[______] can refer to a green area, such as a lawn, park, or a field, and is often used for recreation or for sports such as lawn tennis or bowls.",
        "\"[______]\" as a name has been applied to a wide group of unrelated plants including herbaceous plants whose leaves and stems are eaten by domesticated and wild animals.",
        "Lawns and pasturelands are typically composed of true [______]es, five of which cover 46% of the world's arable land: rice, wheat, maize, barley, and sugar cane.",
        "The three major families of [______]like plants are true [______]es (Poaceae), sedges (Cyperaceae), and rushes (Juncaceae).",
        "[______] refers to various families of plants."
    ],
    "PLANT": [
        "By the definition used in this article, [______]s form the clade Viridi[______]ae (green [______]s), which consists of the green algae and the embryophytes or land [______]s (hornworts, liverworts, mosses, lycophytes, ferns, conifers and other gymnosperms, and flowering [______]s).",
        "Historically, as in Aristotle's biology, the [______] kingdom encompassed all living things that were not animals, and included algae and fungi.",
        "Most [______]s are multicellular, except for some green algae.",
        "Exceptions are parasitic [______]s that have lost the genes for chlorophyll and photosynthesis, and obtain their energy from other [______]s or fungi.",
        "[______]s are the eukaryotes that comprise the kingdom [______]ae; they are predominantly photosynthetic."
    ],
    "TREE": [
        "The majority of [______] species are angiosperms or hardwoods; of the rest, many are gymnosperms or softwoods.",
        " [______]s are not a monophyletic taxonomic group but consist of a wide variety of plant species that have independently evolved a trunk and branches as a way to tower above other plants to compete for sunlight.",
        "Wider definitions include taller palms, [______] ferns, bananas, and bamboos.",
        "In some usages, the definition of a [______] may be narrower, e.g., including only woody plants with secondary growth, only plants that are usable as lumber, or only plants above a specified height.",
        "In botany, a [______] is a perennial plant with an elongated stem, or trunk, usually supporting branches and leaves."
    ],
    "WATER": [
        "Clouds consist of suspended droplets of [______] and ice, its solid state.",
        "Because Earth's environment is relatively close to [______]'s triple point, [______] exists on Earth as a solid, a liquid, and a gas.",
        "Due to its presence in all organisms, its chemical stability, its worldwide abundance, and its strong polarity relative to its small molecular size, [______] is often referred to as the \"universal solvent\".",
        "[______], being a polar molecule, undergoes strong intermolecular hydrogen bonding which is a large contributor to its physical and chemical properties.",
        "[______] is an inorganic compound with the chemical formula H2O."
    ],
    "FLAME": [
        "The high temperature of the [______] causes the vaporized fuel molecules to decompose, forming various incomplete combustion products and free radicals, and these products then react with each other and with the oxidizer involved in the reaction of the following [______] (fire).",
        "In this state they can then readily react with oxygen in the air, which gives off enough heat in the subsequent exothermic reaction to vaporize yet more fuel, thus sustaining a consistent [______].",
        "  == Mechanism ==  Color and temperature of a [______] are dependent on the type of fuel involved in the combustion.",
        "When [______]s are hot enough to have ionized gaseous components of sufficient density, they are then considered plasma.",
        "A [______] (from Latin  flamma) is the visible, gaseous part of a fire."
    ],
    "LIGHT": [
        "The primary properties of [______] are intensity, propagation direction, frequency or wavelength spectrum, and polarization.",
        "In this sense, gamma rays, X-rays, microwaves and radio waves are also [______].",
        "In physics, the term \"[______]\" may refer more broadly to electromagnetic radiation of any wavelength, whether visible or not.",
        "Visible [______] spans the visible spectrum and is usually defined as having wavelengths in the range of 400–700 nanometres (nm), corresponding to frequencies of 750–420 terahertz.",
        "[______], visible [______], or visible radiation is electromagnetic radiation that can be perceived by the human eye."
    ],
    "NIGHT": [
        "[______] on other celestial bodies is affected by their rotation and orbital periods.",
        "The duration of day, [______], and twilight varies depending on the time of year and the latitude.",
        "Moonlight, airglow, starlight, and light pollution dimly illuminate [______].",
        "The opposite of [______]time is daytime.",
        "[______], or [______]time, is the period of darkness when the Sun is below the horizon."
    ],
    "SPACE": [
        "In the 19th and 20th centuries mathematicians began to examine geometries that are non-Euclidean, in which [______] is conceived as curved, rather than flat, as in the Euclidean [______].",
        "The concept of [______] is considered to be of fundamental importance to an understanding of the physical universe.",
        "Modern physicists usually consider it, with time, to be part of a boundless four-dimensional continuum known as [______]time.",
        "In classical physics, physical [______] is often conceived in three linear dimensions.",
        "[______] is a three-dimensional continuum containing positions and directions."
    ],
    "EARTH": [
        "Most of [______]'s land is at least somewhat humid and covered by vegetation, while large ice sheets at [______]'s polar deserts retain more water than [______]'s groundwater, lakes, rivers, and atmospheric water combined.",
        "The remaining 29.2% of [______]'s crust is land, most of which is located in the form of continental landmasses within [______]'s land hemisphere.",
        "Almost all of [______]'s water is contained in its global ocean, covering 70.8% of [______]'s crust.",
        "This is made possible by [______] being an ocean world, the only one in the Solar System sustaining liquid surface water.",
        "[______] is the third planet from the Sun and the only astronomical object known to harbor life."
    ],
    "WORLD": [
        "In scientific cosmology, the [______] or universe is commonly defined as \"the totality of all space and time; all that is, has been, and will be\".",
        "Some treat the [______] as one simple object, while others analyze the [______] as a complex made up of parts.",
        "Some conceptions see the [______] as unique, while others talk of a \"plurality of [______]s\".",
        "The nature of the [______] has been conceptualized differently in different fields.",
        "The [______] is the totality of entities, the whole of reality, or everything that exists."
    ],
    "CLIFF": [
        "The sedimentary rocks that are most likely to form [______]s include sandstone, limestone, chalk, and dolomite.",
        "[______]s are usually composed of rock that is resistant to weathering and erosion.",
        "[______]s are common on coasts, in mountainous areas, escarpments and along rivers.",
        "[______]s are formed by the processes of weathering and erosion, with the effect of gravity.",
        "In geography and geology, a [______] or rock face is an area of rock which has a general angle defined by the vertical, or nearly vertical."
    ],
    "MAGMA": [
        "Mantle and crustal melts migrate upwards through the crust where they are thought to be stored in [______] chambers or trans-crustal crystal-rich mush zones.",
        "[______] is produced by melting of the mantle or the crust in various tectonic settings, which on Earth include subduction zones, continental rift zones, mid-ocean ridges and hotspots.",
        "Besides molten rock, [______] may also contain suspended crystals and gas bubbles.",
        "[______] (sometimes colloquially but incorrectly referred to as lava) is found beneath the surface of the Earth, and evidence of [______]tism has also been discovered on other terrestrial planets and some natural satellites.",
        "[______] (from Ancient Greek  μάγμα (mágma) 'thick unguent') is the molten or semi-molten natural material from which all igneous rocks are formed."
    ],
    "ORBIT": [
        "For most situations, [______]al motion is adequately approximated by Newtonian mechanics, which explains gravity as a force obeying an inverse-square law.",
        "To a close approximation, planets and satellites follow elliptic [______]s, with the center of mass being [______]ed at a focal point of the ellipse, as described by Kepler's laws of planetary motion.",
        "Normally, [______] refers to a regularly repeating trajectory, although it may also refer to a non-repeating trajectory.",
        "Known as an [______]al revolution, examples include the trajectory of a planet around a star, a natural satellite around a planet, or an artificial satellite around an object or position in space such as a planet, moon, asteroid, or Lagrange point.",
        "In celestial mechanics, an [______] is the curved trajectory of an object under the influence of an attracting force."
    ],
    "OZONE": [
        "[______]'s O3 structure was determined in 1865.",
        "[______]'s odour is reminiscent of chlorine, and detectable by many people at concentrations of as little as 0.1 ppm in air.",
        "It is present in very low concentrations throughout the atmosphere, with its highest concentration high in the [______] layer of the stratosphere, which absorbs most of the Sun's ultraviolet (UV) radiation.",
        "[______] is formed from dioxygen by the action of ultraviolet (UV) light and electrical discharges within the Earth's atmosphere.",
        "[______] ( ), also called trioxygen, is an inorganic molecule with the chemical formula O3."
    ],
    "SMOKE": [
        "  == Chemical composition ==  The composition of [______] depends on the nature of the burning fuel and the conditions of combustion.",
        "[______] is an aerosol (or mist) of solid particles and liquid droplets that are close to the ideal range of sizes for Mie scattering of visible light.",
        "The [______] kills by a combination of thermal damage, poisoning and pulmonary irritation caused by carbon monoxide, hydrogen cyanide and other combustion products.",
        "[______] inhalation is the primary cause of death in victims of indoor fires.",
        "[______] is an aerosol (a suspension of airborne particulates and gases) emitted when a material undergoes combustion or pyrolysis, together with the quantity of air that is entrained or otherwise mixed into the mass."
    ],
    "STEAM": [
        "If liquid water comes in contact with a very hot surface or depressurizes quickly below its vapor pressure, it can create a [______] explosion.",
        "Piston-type [______] engines played a central role in the Industrial Revolution and [______]-based generation produces 80 percent of the world's electricity.",
        "When liquid water becomes [______], it increases in volume by 1,700 times at standard temperature and pressure; this change in volume can be converted into mechanical work by [______] engines such as reciprocating piston type engines and [______] turbines.",
        "Superheated or saturated [______] is invisible; however, wet [______], a visible mist or aerosol of water droplets, is often referred to as  \"[______]\".",
        "[______] is water vapor, often mixed with air or an aerosol of liquid water droplets."
    ],
    "SWAMP": [
        "Freshwater [______]s form along large rivers or lakes where they are critically dependent upon rainwater and seasonal flooding to maintain natural water level fluctuations.",
        "The water of a [______] may be fresh water, brackish water, or seawater.",
        "[______]s vary in size and are located all around the world.",
        "[______]s are considered to be transition zones because both land and water play a role in creating this environment.",
        "A [______] is a forested wetland."
    ],
    "DELTA": [
        "  == Pronunciation == In Ancient Greek, [______] represented a voiced dental plosive IPA: [d].",
        "Contrary to a popular legend, this use of the word [______] was not coined by Herodotus.",
        "A river [______] (originally, the [______] of the Nile River) is named so because its shape approximates the triangular uppercase letter [______].",
        "Letters that come from [______] include the Latin D and the Cyrillic Д.",
        "[______] (  DEL-tə; uppercase Δ, lowercase δ; Greek: δέλτα, délta, [ˈðelta]) is the fourth letter of the Greek alphabet."
    ],
    "PHONE": [
        "Tele[______]s permit transmission in both directions simultaneously.",
        "The transmitter converts the sound waves to electrical signals which are sent through the telecommunications system to the receiving tele[______], which converts the signals into audible sound in the receiver or sometimes a loudspeaker.",
        "The essential elements of a tele[______] are a micro[______] (transmitter) to speak into and an ear[______] (receiver) which reproduces the voice at a distant location.",
        "A tele[______] converts sound, typically and most efficiently the human voice, into electronic signals that are transmitted via cables and other communication channels to another tele[______] which reproduces the sound to the receiving user.",
        "A tele[______], commonly shortened to [______], is a telecommunications device that enables two or more users to conduct a conversation when they are too far apart to be easily heard directly."
    ],
    "WATCH": [
        "During most of their history, beginning in the 16th century, [______]es were mechanical devices, driven by clockwork, powered by winding a mainspring, and keeping time with an oscillating balance wheel.",
        "A stop[______] is a type of [______] that measures intervals of time.",
        "A pocket [______] is carried in a pocket, often attached to a chain.",
        "A wrist[______] is worn around the wrist, attached by a [______] strap or another type of bracelet, including metal bands or leather straps.",
        "A [______] is a timepiece carried or worn by a person."
    ],
    "CLOCK": [
        "A major advance occurred with the invention of the verge escapement, which made possible the first mechanical [______]s around 1300 in Europe, which kept time with oscillating timekeepers like balance wheels.",
        "Water [______]s, along with sundials, are possibly the oldest time-measuring instruments.",
        "Some predecessors to the modern [______] may be considered \"[______]s\" that are based on movement in nature: A sundial shows the time by displaying the position of a shadow on a flat surface.",
        "The [______] is one of the oldest human inventions, meeting the need to measure intervals of time shorter than the natural units such as the day, the lunar month, and the year.",
        "A [______] or chronometer is a device that measures and displays time."
    ],
    "PIANO": [
        "The grand [______] offers better sound and more precise key control, making it the preferred choice when space and budget allow.",
        "There are two main types of [______]: the grand [______] and the upright [______].",
        "A musician who specializes in [______] is called a pianist.",
        "Modern [______]s have a row of 88 black and white keys, tuned to a chromatic scale in equal temperament.",
        "A [______] is a keyboard instrument that produces sound when its keys are depressed, activating an action mechanism where hammers strike strings."
    ],
    "DRUMS": [
        "[______] are the world's oldest and most ubiquitous musical instruments, and the basic design has remained virtually unchanged for thousands of years.",
        "Other techniques have been used to cause [______] to make sound, such as the thumb roll.",
        "There is usually a resonant head on the underside of the [______].",
        "[______] consist of at least one membrane, called a [______]head or [______] skin, that is stretched over a shell and struck, either directly with the player's hands, or with a percussion mallet, to produce sound.",
        "The [______] is a member of the percussion group of musical instruments."
    ],
    "FLUTE": [
        "A musician who plays the [______] is called a flautist or flutist.",
        "In the Hornbostel–Sachs classification system, [______]s are edge-blown aerophones.",
        "[______]s produce sound when the player's air flows across an opening.",
        "Like all woodwinds, [______]s are aerophones, producing sound with a vibrating column of air.",
        "The [______] is a member of a family of musical instruments in the woodwind group."
    ],
    "ROBOT": [
        "Autonomous things are expected to proliferate in the future, with home [______]ics and the autonomous car as some of the main drivers.",
        "By mimicking a lifelike appearance or automating movements, a [______] may convey a sense of intelligence or thought of its own.",
        "[______]s may be constructed to evoke human form, but most [______]s are task-performing machines, designed with an emphasis on stark functionality, rather than expressive aesthetics.",
        "A [______] can be guided by an external control device, or the control may be embedded within.",
        "A [______] is a machine—especially one programmable by a computer—capable of carrying out a complex series of actions automatically."
    ],
    "PLANE": [
        "The Wright brothers invented and flew the first air[______] in 1903, recognized as \"the first sustained and controlled heavier-than-air powered flight\".",
        "Most air[______]s are flown by a pilot on board the aircraft, but some are designed to be remotely or computer-controlled, such as drones.",
        "The broad spectrum of uses for air[______]s includes recreation, transportation of goods and people, military, and research.",
        "Air[______]s come in a variety of sizes, shapes, and wing configurations.",
        "An air[______] (American English), or aero[______] (Commonwealth English), informally [______], is a fixed-wing aircraft that is propelled forward by thrust from a jet engine, propeller, or rocket engine."
    ],
    "TRAIN": [
        "[______]s have their roots in wagonways, which used railway tracks and were powered by horses or pulled by cables.",
        "Most [______]s operate on steel tracks with steel wheels, the low friction of which makes them more efficient than other forms of transport.",
        "[______]s are designed to a certain gauge, or distance between rails.",
        "[______]s are typically pulled or pushed by locomotives (often known simply as \"engines\"), though some are self-propelled, such as multiple units or railcars.",
        "A [______] (from Old French trahiner, from Latin trahere, \"to pull, to draw\") is a series of connected vehicles that run along a railway track and transport people or freight."
    ],
    "TRUCK": [
        "The majority of [______]s currently in use are powered by diesel engines, although small- to medium-size [______]s with gasoline engines exist in North America.",
        "In American English, a commercial vehicle without a trailer or other articulation is formally a \"straight [______]\" while one designed specifically to pull a trailer is not a [______] but a \"tractor\".",
        "Commercial [______]s can be very large and powerful and may be configured to be mounted with specialized equipment, such as in the case of refuse [______]s, fire [______]s, concrete mixers, and suction excavators.",
        "[______]s vary greatly in size, power, and configuration, but the vast majority feature body-on-frame construction, with a cabin that is independent of the payload portion of the vehicle.",
        "A [______] (North American and Australian English) or lorry (British English) is a motor vehicle designed to transport freight, carry specialized payloads, or perform other utilitarian work."
    ],
    "BRICK": [
        "Block is a similar term referring to a rectangular building unit composed of clay or concrete, but is usually larger than a [______].",
        "[______]s are usually produced at [______]works in numerous classes, types, materials, and sizes which vary with region, and are produced in bulk quantities.",
        "[______]s can be joined using mortar, adhesives or by interlocking.",
        "Properly, the term [______] denotes a unit primarily composed of clay, but it is now also used informally to denote building units made of other materials or other chemically cured construction blocks.",
        "A [______] is a type of building material used to build walls, pavements, and other elements in masonry construction."
    ],
    "BLOCK": [
        "A particularly long program [______], especially one that does not air on a regular schedule, is known as a marathon.",
        "Reruns on cable television are often assembled into similar [______]s to fill several hours of generally little-watched daytime periods.",
        "Notable examples of overt [______] programming have included NBC's Thursday-evening \"Must See TV\" lineup (built around its popular sitcom Friends, and drama ER), and Cartoon Network's Cartoon Cartoon Fridays (which primarily aired premieres of the network's original series).",
        "  == Overview == [______] programming involves scheduling a series of related shows which are likely to attract and hold a given audience for a long period of time.",
        "[______] programming (also known as a strand in British broadcasting) is the arrangement of programs on radio or television so that those of a particular genre, theme, or target audience are united."
    ],
    "PAPER": [
        "Before the industrialization of [______] production, the most common [______] was rag [______], made from discarded natural fiber textiles collected by ragpickers.",
        "The [______]making process developed in East Asia at least as early as 105 CE by the Han court eunuch Cai Lun, although archaeological evidence exists of 2nd century BCE [______]-like material in China.",
        "Different types of [______] are defined by constituent fiber, [______] pulp, sizing, coating, [______] size, [______] density and grammage.",
        "Largely derived from lignocellulose, [______] is created from a pulp dissolved into a slurry that is drained and dried into sheets.",
        "[______] is a thin sheet of matted cellulose fibers."
    ],
    "CHAIR": [
        "  == History ==  The [______] has been used since antiquity, although for many centuries it was a symbolic article of state and dignity rather than an article for ordinary use.",
        "    == Etymology == [______] comes from the early 13th-century English word chaere, from Old French chaiere (\"[______], seat, throne\"), from Latin cathedra and ultimately Greek καθέδρα kathedra (\"seat, throne\").",
        "An arm[______] has armrests fixed to the seat; a recliner is upholstered and features a mechanism that lowers the [______]'s back and raises into place a footrest; a rocking [______] has legs fixed to two long curved slats; and a wheel[______] has wheels fixed to an axis under the seat.",
        "[______]s vary in design.",
        "A [______] is a type of seat, typically designed for one person and consisting of one or more legs, a flat or slightly angled seat and a back-rest."
    ],
    "TABLE": [
        "Besides the actual data rows, [______]s generally have associated with them some metadata, such as constraints on the [______] or on the values within particular columns.",
        "\"[______]\" is another term for \"relation\"; although there is the difference in that a [______] is usually a multiset (bag) of rows where a relation is a set and does not allow duplicates.",
        "A [______] has a specified number of columns, but can have any number of rows.",
        "In relational databases, and flat file databases, a [______] is a set of data elements (values) using a model of vertical columns (identifiable by name) and horizontal rows, the cell being the unit where a row and column intersect.",
        "In a database, a [______] is a collection of related data organized in [______] format; consisting of columns and rows."
    ],
    "SPOON": [
        "  == Terminology == The [______] consists of a bowl and a handle.",
        "There are many different types of [______]s made from different materials by different cultures for different purposes and food.",
        "Present day [______]s are made from metal (notably stainless steel, flat silver or silverware, plated or solid), wood, porcelain or plastic.",
        "[______]s are also used in food preparation to measure, mix, stir and toss ingredients and for serving food.",
        "A [______] (UK: , US:  [______]) is a utensil consisting of a shallow bowl (also known as a head), oval or round, at the end of a handle."
    ],
    "PLATE": [
        "Vessels with no lip, especially if they have a more rounded profile, are likely to be considered as bowls or dishes, as are very large vessels with a [______] shape.",
        "Generally [______]s are raised round the edges, either by a curving up, or a wider lip or raised portion.",
        "Most [______]s are circular, but they may be any shape, or made of any water-resistant material.",
        " A [______] can also be used for ceremonial or decorative purposes.",
        "A [______] is a broad, mainly flat vessel on which food can be served."
    ],
    "GLASS": [
        "Some [______]es such as volcanic [______] are naturally occurring, and obsidian has been used to make arrowheads and knives since the Stone Age.",
        "[______] is most often formed by rapid cooling (quenching) of the molten form.",
        "Some common objects made of [______] are named after the material, e.g., a \"[______]\" for drinking, \"[______]es\" for vision correction, and a \"magnifying [______]\".",
        "Because it is often transparent and chemically inert, [______] has found widespread practical, technological, and decorative use in window panes, tableware, and optics.",
        "[______] is an amorphous (non-crystalline) solid."
    ],
    "RADIO": [
        "In radar, used to locate and track objects like aircraft, ships, spacecraft and missiles, a beam of [______] waves emitted by a radar transmitter reflects off the target object, and the reflected waves reveal the object's location to a receiver that is typically colocated with the transmitter.",
        "In addition to communication, [______] is used for radar, [______] navigation, remote control, remote sensing, and other applications.",
        "They can be received by other antennas connected to a [______] receiver; this is the fundamental principle of [______] communication.",
        "[______] waves are electromagnetic waves of frequency between 3 hertz (Hz) and 300 gigahertz (GHz).",
        "[______] is the technology of communicating using [______] waves."
    ],
    "VIDEO": [
        "  == Etymology == The word [______] comes from the Latin [______], \"I see,\" the first-person singular present indicative of videre, \"to see\".",
        "Both analog and digital [______] can be carried on a variety of media, including radio, magnetic tape, optical discs, computer files, and network streaming.",
        "[______] systems vary in display resolution, aspect ratio, refresh rate, color reproduction, and other qualities.",
        "[______] was first developed for mechanical television systems, which were quickly replaced by cathode-ray tube (CRT) systems, which, in turn, were replaced by flat-panel displays.",
        "[______] is an electronic medium for the recording, copying, playback, broadcast, and display of moving-image media."
    ],
    "LASER": [
        "Spatial coherence allows a [______] to be focused to a tight spot, enabling uses such as optical communication, [______] cutting, and lithography.",
        "A [______] differs from other sources of light in that it emits light that is coherent.",
        "The first [______] was built in 1960 by Theodore Maiman at Hughes Research Laboratories, based on theoretical work by Charles H.",
        "The word [______] originated as an acronym for light amplification by stimulated emission of radiation.",
        "A [______] is a device that emits light through a process of optical amplification based on the stimulated emission of electromagnetic radiation."
    ],
    "RADAR": [
        "Modern high tech [______] systems use digital signal processing and machine learning and are capable of extracting useful information from very high noise levels.",
        "A [______] system consists of a transmitter producing electromagnetic waves in the radio or microwave domain, a transmitting antenna, a receiving antenna (often the same antenna is used for transmitting and receiving) and a receiver and processor to determine properties of the objects.",
        "The term [______] has since entered English and other languages as an anacronym, a common noun, losing all capitalization.",
        "The term [______] was coined in 1940 by the United States Navy as an acronym for \"radio detection and ranging\".",
        "[______] is a system that uses radio waves to determine the distance (ranging), direction (azimuth and elevation angles), and radial velocity of objects relative to the site."
    ],
    "BADGE": [
        "  == History == [______]s were as popular as jewellery in the Middle Ages, and varied from extremely expensive works of jewellery, like the Dunstable Swan Jewel, to simple mold-made [______]s in lead or other base metals.",
        "In the military, [______]s are used to denote the unit or arm to which the wearer belongs, and also qualifications received through military training, rank, etc.",
        "[______]s have become highly collectable: in the UK, for example, the [______] Collectors' Circle has been in existence since 1980.",
        "Textile [______]s or patches can be either woven or embroidered, and can be attached by gluing, ironing-on, sewing or applique.",
        "[______]s can be made from metal, plastic, leather, textile, rubber, etc., and they are commonly attached to clothing, bags, footwear, vehicles, home electrical equipment, etc."
    ],
    "CHAIN": [
        "Two distinct [______]s can be connected using a quick link, carabiner, shackle, or clevis.",
        "They are known as roller [______]s, though there are also non-roller [______]s such as block [______]s.",
        "Small [______]s serving as jewellery are a mostly decorative analogue of such types.",
        "A [______] may consist of two or more links.",
        "A [______] is a serial assembly of connected links typically made of metal, with an overall character similar to that of a rope in that it is flexible and curved in compression, but linear, rigid, and load-bearing in tension."
    ],
    "GLOVE": [
        "[______]s and gauntlets are integral components of pressure suits and spacesuits.",
        "[______]s of kevlar protect the wearer from cuts.",
        "[______]s are made of materials including cloth, knitted or felted wool, leather, rubber, latex, neoprene, silk, and (in mail) metal.",
        "[______]s protect and comfort hands against cold or heat, damage by friction, abrasion or chemicals, and disease; or in turn to provide a guard for what a bare hand should not touch.",
        "A [______] is a garment covering the hand, with separate sheaths or openings for each finger including the thumb."
    ],
    "HINGE": [
        "[______]s are frequently used on pivoting doors, but also are seen on folding ladders and many other flexible mechanisms such as automobile hoods (bonnets), and even large bridges.",
        "In biology, many joints function as [______]s, such as the elbow joint.",
        "[______]s may be made of flexible material or moving components.",
        "Two objects connected by an ideal [______] rotate relative to each other about a fixed axis of rotation, with all other translations or rotations prevented; thus a [______] has one degree of freedom.",
        "A [______] is a mechanical bearing that connects two solid objects, typically allowing only a limited angle of rotation between them."
    ],
    "LEVER": [
        "As such, the [______] is a mechanical advantage device, trading off force against movement.",
        "A [______] amplifies an input force to provide a greater output force, which is said to provide [______]age, which is mechanical advantage gained in the system, equal to the ratio of the output force to the input force.",
        "On the basis of the locations of fulcrum, load, and effort, the [______] is divided into three types.",
        "A [______] is a rigid body capable of rotating on a point on itself.",
        "A [______] is a simple machine consisting of a beam or rigid rod pivoted at a fixed hinge, or fulcrum."
    ],
    "HOUSE": [
        "A [______] may have a separate dining room, or the eating area may be integrated into the kitchen or another room.",
        "Most conventional modern [______]s in Western cultures will contain one or more bedrooms and bathrooms, a kitchen or cooking area, and a living room.",
        "[______]s generally have doors or locks to secure the dwelling space and protect its inhabitants and contents from burglars or other trespassers.",
        "[______]s use a range of different roofing systems to keep precipitation such as rain from getting into the dwelling space.",
        "A [______] is a single-unit residential building."
    ],
    "HOTEL": [
        "Some boutique, high-end [______]s have custom decorated rooms.",
        "[______] rooms are usually numbered (or named in some smaller [______]s and B&Bs) to allow guests to identify their room.",
        "Small, lower-priced [______]s may offer only the most basic guest services and facilities.",
        "Facilities provided inside a [______] room may range from a modest-quality mattress in a small room to large suites with bigger, higher-quality beds, a dresser, a refrigerator, and other kitchen facilities, upholstered chairs, a television, and en-suite bathrooms.",
        "A [______] is an establishment that provides paid lodging on a short-term basis."
    ],
    "TOWER": [
        "[______]s may also be built for observation, leisure, or telecommunication purposes.",
        "For example, the height of a clock [______] improves the visibility of the clock, and the height of a [______] in a fortified building such as a castle increases the visibility of the surroundings for defensive purposes.",
        "[______]s are specifically distinguished from buildings in that they are built not to be habitable but to serve other functions using the height of the [______].",
        "[______]s are distinguished from masts by their lack of guy-wires and are therefore, along with tall buildings, self-supporting structures.",
        "A [______] is a tall structure, taller than it is wide, often by a significant factor."
    ],
    "PARK": [
        "[______]s may consist of grassy areas, rocks, soil and trees, but may also contain buildings and other artifacts such as monuments, fountains or playground structures.",
        "State [______]s and provincial [______]s are administered by sub-national government states and agencies.",
        "National [______]s and country [______]s are green spaces used for recreation in the countryside.",
        "Urban [______]s are green spaces set aside for recreation inside towns and cities.",
        "A [______] is an area of natural, semi-natural or planted space set aside for human enjoyment and recreation or for the protection of wildlife or natural habitats."
    ],
    "YARD": [
        "It is first attested in the late 7th century laws of Ine of Wessex, wherein the \"[______] of land\" mentioned is the [______]land, an old English unit of tax assessment equal to 1⁄4 hide.",
        "  == Name ==  The term, [______] derives from the Old English gerd, gyrd etc., which was used for branches, staves and measuring rods.",
        "The theoretical US survey [______] is very slightly longer.",
        "A distance of 1,760 [______]s is equal to 1 mile.",
        "The [______] (symbol: yd) is an English unit of length in both the British imperial and US customary systems of measurement equalling 3 feet or 36 inches."
    ],
    "ATTIC": [
        "The hot air rising from the lower floors of a building is often retained in [______]s, further compounding their reputation as inhospitable environments.",
        "[______]s help control temperatures in a house by providing a large mass of slowly moving air, and are often used for storage.",
        "While some [______]s are converted into bedrooms, home offices, or [______] apartments complete with windows and staircases, most remain difficult to access, and are usually entered using a loft hatch and ladder.",
        "Because they fill the space between the ceiling of a building's top floor and its slanted roof, [______]s are known for being awkwardly-shaped spaces with difficult-to-reach corners and often exposed rafters.",
        "An [______] (sometimes referred to as a loft) is a space found directly below the pitched roof of a house or other building."
    ],
    "RANCH": [
        "[______]es generally consist of large areas, but may be of nearly any size.",
        "[______]ing is also a method used to raise less common livestock such as horses, elk, American bison, ostrich, emu, and alpaca.",
        "People who own or operate a [______] are called [______]ers, cattlemen, or stockgrowers.",
        "These terms are most often applied to livestock-raising operations in Mexico, the Western United States and Western Canada, though there are [______]es in other areas.",
        "A [______] (from Spanish: [______]o/Mexican Spanish) is an area of land, including various structures, given primarily to [______]ing, the practice of raising grazing livestock such as cattle and sheep."
    ],
    "SHED": [
        "Small [______]s may include a wooden or plastic floor, while more permanent ones may be built on a concrete pad or foundation.",
        "The main types of [______] construction are metal sheathing over a metal frame, plastic sheathing and frame, all-wood construction (the roof may be asphalt shingled or sheathed in tin), and vinyl-sided [______]s built over a wooden frame.",
        "[______]s used on farms or in the industry can be large structures.",
        "[______]s vary considerably in their size and complexity of construction, from simple open-sided ones designed to cover bicycles or garden items to large wood-framed structures with shingled roofs, windows, and electrical outlets.",
        "A [______] is typically a simple, single-storey (though some [______]s may have two or more stories and or a loft) roofed structure, often used for storage, for hobbies, or as a workshop, and typically serving as outbuilding, such as in a back garden or on an allotment."
    ],
    "ARENA": [
        "The term [______] is sometimes used as a synonym for a very large venue such as Pasadena's Rose Bowl, but such a facility is typically called a stadium.",
        "  == Background ==  The word derives from Latin h[______], a particularly fine-grained sand that covered the floor of ancient [______]s such as the Colosseum in Rome, Italy, to absorb blood.",
        "[______]s are usually designed to accommodate a multitude of spectators.",
        "The key feature of an [______] is that the event space is the lowest point, allowing maximum visibility.",
        "An [______] is a large enclosed venue, often circular or oval-shaped, designed to showcase theatre, musical performances or sporting events."
    ],
    "HEART": [
        "Commonly, the right atrium and ventricle are referred together as the right [______] and their left counterparts as the left [______].",
        "In humans, the [______] is divided into four chambers: upper left and right atria and lower left and right ventricles.",
        "In humans, the [______] is approximately the size of a closed fist and is located between the lungs, in the middle compartment of the chest, called the mediastinum.",
        "The [______] and blood vessels together make up the circulatory system.",
        "The [______] is a muscular organ found in humans and other animals."
    ],
    "MOUTH": [
        "Most bilaterian phyla, including arthropods, molluscs and chordates, have a two-opening gut tube with a [______] at one end and an anus at the other.",
        "Except for some groups like birds and lissamphibians, vertebrates usually have teeth in their [______]s, although some fish species have pharyngeal teeth instead of oral teeth.",
        "In tetrapod vertebrates, the [______] is bounded on the outside by the lips and cheeks — thus the oral cavity is also known as the buccal cavity (from Latin bucca, meaning \"cheek\") — and contains the tongue on the inside.",
        "The body cavity immediately behind the [______] opening, known as the oral cavity (or cavum oris in Latin), is also the first part of the alimentary canal, which leads to the pharynx and the gullet.",
        "A [______] also referred to as the oral is the body orifice through which many animals ingest food and vocalize."
    ],
    "BLOOD": [
        "The most abundant cells are red [______] cells.",
        "The [______] cells are mainly red [______] cells (erythrocytes), white [______] cells (leukocytes), and (in mammals) platelets (thrombocytes).",
        "Plasma, which constitutes 55% of [______] fluid, is mostly water (92% by volume), and contains proteins, glucose, mineral ions, and hormones.",
        "[______] is composed of [______] cells suspended in plasma.",
        "[______] is a body fluid in the circulatory system of humans and other vertebrates that delivers necessary substances such as nutrients and oxygen to the cells, and transports metabolic waste products away from those same cells."
    ],
    "BONES": [
        "[______] tissue is made up of different types of [______] cells: osteoblasts and osteocytes ([______] formation and mineralisation); osteoclasts ([______] resorption); modified or flattened osteoblasts (lining cells that form a protective layer on the [______] surface).",
        "[______] tissue (also known as osseous tissue or [______] in the uncountable) is a form of hard tissue, specialised connective tissue that is mineralized and has an intercellular honeycomb-like matrix, which helps to give the [______] rigidity.",
        "[______] come in a variety of shapes and sizes and have complex internal and external structures.",
        "[______] protect the organs of the body, produce red and white blood cells, store minerals, help regulate acid-base homeostasis, provide structure and support for the body, and enable mobility and hearing.",
        "A [______] is a rigid organ that constitutes part of the skeleton in most vertebrate animals."
    ],
    "SKULL": [
        "The [______] forms the frontmost portion of the axial skeleton and is a product of cephalization and vesicular enlargement of the brain, with several special senses structures such as the eyes, ears, nose, tongue and, in fish, specialized tactile organs such as barbels near the mouth.",
        " In the  human, the [______] comprises two prominent parts: the neurocranium and the facial skeleton, which evolved from the first pharyngeal arch.",
        "The [______] is at the head end of the vertebrate.",
        "In some fish and amphibians, the [______] is of cartilage.",
        "The [______], or cranium, is typically a bony enclosure around the brain of a vertebrate."
    ],
    "HANDS": [
        "The human [______] usually has five digits: four fingers plus one thumb; however, these are often referred to collectively as five fingers, whereby the thumb is included as one of the fingers.",
        "Some evolutionary anatomists use the term [______] to refer to the appendage of digits on the forelimb more generally—for example, in the context of whether the three digits of the bird [______] involved the same homologous loss of two digits as in the dinosaur [______].",
        "The raccoon is usually described as having \"[______]\" though opposable thumbs are lacking.",
        "A few other vertebrates such as the koala (which has two opposable thumbs on each \"[______]\" and fingerprints extremely similar to human fingerprints) are often described as having \"[______]\" instead of paws on their front limbs.",
        "A [______] is a prehensile, multi-fingered appendage located at the end of the forearm or forelimb of primates such as humans, chimpanzees, monkeys, and lemurs."
    ],
    "PILOT": [
        "People who operate aircraft obtain a [______] licence.",
        "The term aviator (aviateur in French), now archaic, was formerly used for a male [______].",
        "The term aviatrix (aviatrice in French), now archaic, was formerly used for a female [______].",
        "To recognize [______]s' qualifications and responsibilities, most militaries and many airlines around the world award aviator badges to their [______]s.",
        "An aircraft [______], or aviator, is an individual who controls an aircraft's flight by operating its directional controls."
    ],
    "NURSE": [
        "In the United Kingdom and the United States, clinical [______] specialists and [______] practitioners diagnose health problems and prescribe medications and other therapies, depending on regulations that vary by state.",
        "[______]s develop a plan of care, working collaboratively with physicians, therapists, patients, patients' families, and other team members that focuses on treating illness to improve quality of life.",
        "There are shortages of qualified [______]s in many countries.",
        "[______]s comprise the largest component of most healthcare environments.",
        "[______]s practice in many specialties with varying levels of certification and responsibility."
    ],
    "JUDGE": [
        "In inquisitorial systems of criminal investigation, a [______] might also be an examining magistrate.",
        "In some jurisdictions, the [______]'s powers may be shared with a jury.",
        "The powers, functions, method of appointment, discipline, and training of [______]s vary widely across different jurisdictions.",
        "A [______] is expected to conduct the trial impartially and, typically, in an open court.",
        "A [______] is a person who presides over court proceedings, either alone or as a part of a judicial panel."
    ],
    "GUARD": [
        "  == Roles ==  The work of a body[______] consists mainly of planning routes, pre-searching rooms and buildings where the client will be visiting, researching the backgrounds of people that will have contact with the client, searching vehicles, and escorting the client on their day-to-day activities.",
        "Body[______]s have existed since ancient civilizations, with notable examples including the Roman Praetorian [______], Persian Immortals, and the Janissaries of the Ottoman Empire.",
        "Less-important public figures, or those with lower risk profiles, may be accompanied by a single body[______] who doubles as a driver.",
        "Most important public figures, such as heads of state, heads of government, and governors are protected by a team of body[______]s from a government agency, security forces, or police forces.",
        "A body[______] (or close protection officer/operative) is a type of security [______], government law enforcement officer, or servicemember who protects an important person or group of people, such as high-ranking public officials, wealthy businesspeople, and celebrities, from harm."
    ],
    "ACTOR": [
        "Interpretation occurs even when the [______] is \"playing themselves\", as in some forms of experimental performance art.",
        "This can also be considered an \"[______]'s role\", which was called this due to scrolls being used in the theaters.",
        "The [______]'s interpretation of a role—the art of acting pertains to the role played, whether based on a real person or fictional character.",
        "The [______] performs \"in the flesh\" in the traditional medium of the theatre or in modern media such as film, radio, and television.",
        "An [______] (masculine/gender-neutral), or actress (feminine), is a person who portrays a character in a production."
    ],
    "BAKER": [
        "Large households in Rome normally had their own [______]s.",
        "In ancient Rome, [______]s (Latin, pistor) were sometimes slaves, who were (like other slave-artisans) sometimes manumitted.",
        "In ancient Rome several centuries later, the first mass production of breads occurred, and \"the baking profession can be said to have started at that time.\" Ancient Roman [______]s used honey and oil in their products, creating pastries rather than breads.",
        "The place where a [______] works is called a [______]y.",
        "A [______] is a tradesperson who bakes and sometimes sells breads and other products made of flour by using an oven or other concentrated heat source."
    ],
    "CLOWN": [
        "However, [______]s have also played roles in theater and folklore, like the court jesters of the Middle Ages and the jesters and ritual [______]s of various indigenous cultures.",
        "The most recognizable [______]s are those that commonly perform in the circus, characterized by colorful wigs, red noses, and oversized shoes.",
        "[______]s have a diverse tradition with significant variations in costume and performance.",
        "The art of performing as a [______] is known as [______]ing or buffoonery, and the term \"[______]\" may be used synonymously with predecessors like jester, joker, buffoon, fool, or harlequin.",
        "A [______] is a person who performs physical comedy and arts in an open-ended fashion, typically while wearing distinct makeup or costuming and reversing folkway-norms."
    ],
    "SCOUT": [
        "In the United States there were around 6 million [______]s in 2011.",
        "Some [______] organizations have special interest programs such as Air [______]s, Sea [______]s, high adventure, [______] bands, mounted [______]s and cyclist [______]s.",
        "[______]s are often organized into patrols of about 6–8 [______]s under a patrol leader with a number of patrols forming a larger troop under the guidance of one or more adult leaders or [______]masters.",
        "Some [______] organizations have split this wide age group development span into junior and senior programs.",
        "A [______], Boy [______], Girl [______], or, in some countries, a Pathfinder is a participant in the [______] Movement, usually aged 10–18 years, who engages in learning [______]craft and outdoor and other special interest activities."
    ],
    "CHIEF": [
        "  == United States ==  [______] master sergeant (abbreviated as CMSgt) is the ninth, and highest, enlisted rank in the United States Air Force and the United States Space Force, just above senior master sergeant, and is a senior non-commissioned officer rank.",
        "The equivalent naval rating is that of master [______] petty officer.",
        "The rank of [______] master sergeant stands above that of senior master sergeant.",
        "Above the rank is that of first [______] master sergeant, also created in 2004 and bestowed on the most veteran non-commissioned officer who has served in the aforementioned service branches.",
        "A [______] master sergeant is the military rank for a senior non-commissioned officer in the armed forces of some countries."
    ],
    "ADULT": [
        "The typical age of attaining [______]hood for humans is 18 years, although definition may vary by country.",
        "In contrast to a non-[______] or \"minor\", a legal [______] is a person who has attained the age of majority and is therefore regarded as independent, self-sufficient, and responsible.",
        " In the human context, the term [______] has meanings associated with legal and social concepts.",
        "The biological definition of [______] is an organism that has reached sexual maturity and thus capable of reproduction.",
        "An [______] is an animal that has reached full growth."
    ],
    "CHILD": [
        "The term [______] may also refer to someone below another legally defined age limit unconnected to the age of majority.",
        "The United Nations Convention on the Rights of the [______] defines [______] as, \"A human being below the age of 18 years unless under the law applicable to the [______], majority is attained earlier.\" This is ratified by 192 of 194 member countries.",
        "Legally, the term [______] may refer to anyone below the age of majority or some other age limit.",
        "[______]ren generally have fewer rights and responsibilities than adults.",
        "A [______] (pl. [______]ren) is a human being between the stages of birth and puberty, or between the developmental period of infancy and puberty."
    ],
    "HUMAN": [
        "As of 2025, there are estimated to be more than 8 billion living [______]s.",
        "As such, social interactions between [______]s have established a wide variety of values, social norms, languages, and traditions (collectively termed institutions), each of which bolsters [______] society.",
        "[______]s are highly social, with individual [______]s tending to belong to a multi-layered network of distinct social groups – from families and peer groups to corporations and political states.",
        "[______]s have large brains compared to body size, enabling more advanced cognitive skills that facilitate successful adaptation to varied environments, development of sophisticated tools, and formation of complex social structures and civilizations.",
        "[______]s, scientifically known as Homo sapiens, are primates that belong to the biological family of great apes and are characterized by hairlessness, bipedality, and high intelligence."
    ],
    "SHIRT": [
        "Although the women's chemise was a closely related garment to the men's, it is the men's garment that became the modern [______].",
        "The small fringe formed during weaving along one edge of the cloth has been placed by the designer to decorate the neck opening and side seam.\" The [______] was an item of clothing that only men could wear as underwear, until the twentieth century.",
        "A [______] can also be worn with a necktie under the [______] collar.",
        "In British English, a [______] is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress [______]\", a specific type of collared [______]).",
        "A [______] is a cloth garment for the upper body (from the neck to the waist)."
    ],
    "SHOES": [
        "Additionally, [______] have often evolved into many different designs; high heels, for instance, are most commonly worn by women during fancy occasions.",
        "Some [______] are worn as safety equipment, such as steel-toe boots, which are required footwear at industrial worksites.",
        "Form was originally tied to function, but over time, [______] also became fashion items.",
        "Though the human foot can adapt to varied terrains and climate conditions, it is vulnerable, and [______] provide protection.",
        "A [______] is an item of footwear intended to protect and comfort the human foot."
    ],
    "DRESS": [
        "[______]es are generally suitable for both formal wear and casual wear.",
        "In particular, [______]es can vary by sleeve length, neckline, skirt length, or hemline.",
        " [______] shapes, silhouettes, textiles, and colors vary.",
        "[______]es often consist of a bodice attached to a skirt.",
        "A [______] (also known as a frock or a gown) is a one-piece outer garment that is worn on the torso, hangs down over the legs."
    ],
    "BOOTS": [
        "Traditionally made of leather or rubber, modern [______] are made from a variety of materials.",
        "Most [______] have a heel that is clearly distinguishable from the rest of the sole, even if the two are made of one piece.",
        "Some [______] extend up the leg, sometimes as far as the knee or even the hip.",
        "Most [______] mainly cover the foot and the ankle, while some also cover some part of the lower calf.",
        "A [______] is a type of footwear."
    ],
    "DENIM": [
        "  == Etymology == [______] originated as a contraction of the French phrase sergé de Nîmes ('serge from Nîmes').",
        "[______] is used to create a wide variety of garments, accessories, and furniture.",
        "[______] is available in a range of colors, but the most common [______] is indigo [______] in which the warp thread is dyed while the weft thread is left white.",
        " [______], as it is recognised today, was first produced in Nîmes, France.",
        "[______] is a sturdy cotton warp-faced textile in which the weft passes under two or more warp threads."
    ],
    "LINEN": [
        "[______] also has other distinctive characteristics, such as its tendency to wrinkle.",
        "[______] textiles can be made from flax plant fiber, yarn, as well as woven and knitted.",
        "Because of these properties, [______] is comfortable to wear in hot weather and is valued for use in garments.",
        "[______] is very strong and absorbent, and it dries faster than cotton.",
        "[______] () is a textile made from the fibers of the flax plant."
    ],
    "NYLON": [
        "Numerous types of [______] are available.",
        "The properties of [______]s are often modified by blending with a variety of additives.",
        "As thermoplastics, [______]s can be melt-processed into fibers, films, and diverse shapes.",
        "[______]s are generally brownish in color and can possess a soft texture, with some varieties exhibiting a silk-like appearance.",
        "[______] is a family of synthetic polymers characterized by amide linkages, typically connecting aliphatic or semi-aromatic groups."
    ],
    "SATIN": [
        "If a fabric is formed with a [______] weave using filament fibres such as silk, polyester or nylon, the corresponding fabric is termed a '[______]', although some definitions insist that a [______] fabric is only made from silk.",
        "[______] is usually a warp-faced weaving technique in which warp yarns are \"floated\" over weft yarns, although there are also weft-faced [______]s.",
        "Floats are missed interfacings, for example where the warp yarn lies on top of the weft in a warp-faced [______].",
        "The [______] weave is characterised by four or more fill or weft yarns floating over a warp yarn, and four warp yarns floating over a single weft yarn.",
        "A [______] weave is a type of fabric weave that produces a characteristically glossy, smooth or lustrous material, typically with a glossy top surface and a dull back; it is not durable, as it tends to snag."
    ],
    "SILK": [
        "Harvested [______] is produced by numerous insects; generally, only the [______] of various moth caterpillars has been used for textile manufacturing.",
        "The shimmery appearance of [______] is due to the triangular prism-like structure of the [______] fiber, which causes [______] cloth to refract incoming light at different angles, thus producing different colors.",
        "The best-known [______] is obtained from the cocoons of the larvae of the mulberry [______]worm Bombyx mori, which are reared in captivity (sericulture).",
        "The protein fiber of [______] is composed mainly of fibroin.",
        "[______] is a natural protein fiber, some forms of which can be woven into textiles."
    ],
    "VELVET": [
        "This complicated process meant that [______] was expensive to make before industrial power looms became available, and well-made [______] remains a fairly costly fabric.",
        "  == Construction and composition ==  [______] is woven on a special loom that weaves two thicknesses of the material at the same time; the two layers are connected with an extra warp yarn that is woven over rods or wires.",
        "Modern [______] can be made from silk, linen, cotton, wool, synthetic fibers, silk-cotton blends, or synthetic-natural fiber blends.",
        "Historically, [______] was typically made from silk.",
        "[______] is a type of woven fabric with a dense, even pile that gives it a distinctive soft feel."
    ],
    "WOOL": [
        "  == Characteristics == [______] is produced by follicles which are small cells located in the skin.",
        "Like silk, the proteinaceous nature of [______] requires special detergents when being cleaned because laundry detergents made to clean cellulose-based fabrics often contain stain-removing enzymes that digest protein.",
        "[______] is an animal fiber and consists of protein together with a small percentage of lipids.",
        "The term may also refer to inorganic materials, such as mineral [______] and glass [______], that have some properties similar to animal [______].",
        "[______] is the textile fiber obtained from sheep and other mammals, especially goats, rabbits, and camelids."
    ],
    "STEEL": [
        "Stainless [______]s, for example, typically contain 18% chromium and exhibit improved corrosion and oxidation resistance versus their carbon [______] counterpart.",
        "Iron is always the main element in [______], but other elements are used to produce various grades of [______], demonstrating altered material, mechanical, and microstructural properties.",
        "[______] is used in structures (as concrete reinforcing rods or [______] beams), in bridges, infrastructure, tools, ships, trains, cars, bicycles, machines, electrical appliances, furniture, and weapons.",
        "Due to its high elastic modulus, yield strength, fracture strength and low raw material cost, [______] is one of the most commonly manufactured materials in the world.",
        "[______] is an alloy of iron and carbon that demonstrates improved mechanical properties compared to the pure form of iron."
    ],
    "METAL": [
        "The general science of [______]s is called [______]lurgy, a subtopic of materials science; aspects of the electronic and thermal properties are also within the scope of condensed matter physics and solid-state chemistry, it is a multidisciplinary topic.",
        "A [______] may be a chemical element such as iron; an alloy such as stainless steel; or a molecular compound such as polymeric sulfur nitride.",
        "[______]s are typically ductile (can be drawn into a wire) and malleable (can be shaped via hammering or pressing).",
        "These properties are all associated with having electrons available at the Fermi level, as opposed to non[______]lic materials which do not.",
        "A [______] (from Ancient Greek  μέταλλον (métallon) 'mine, quarry, [______]') is a material that, when polished or fractured, shows a lustrous appearance, and conducts electricity and heat relatively well."
    ],
    "MUSIC": [
        "[______] is often characterized as a highly versatile medium for expressing human creativity.",
        "While scholars agree that [______] is defined by a small number of specific elements, there is no consensus as to what these necessary elements are.",
        "Definitions of [______] vary widely in substance and approach.",
        "[______] is generally agreed to be a cultural universal that is present in all human societies.",
        "[______] is the arrangement of sound to create some combination of form, harmony, melody, rhythm, or otherwise expressive content."
    ],
    "DANCE": [
        "Both types of [______] may have special functions, whether social, ceremonial, competitive, erotic, martial, sacred or liturgical.",
        "Two common types of group [______] are theatrical and participatory [______].",
        "[______] is typically performed with musical accompaniment, and sometimes with the [______]r simultaneously using a musical instrument themselves.",
        "[______] can be categorized and described by its choreography, by its repertoire of movements or by its historical period or place of origin.",
        "[______] is an art form, consisting of sequences of body movements with aesthetic and often symbolic value, either improvised or purposefully selected."
    ],
    "PARTY": [
        "  == Types ==   === Balls ===   === Banquets ===   === Birthday [______] ===  A birthday [______] is a celebration of the anniversary of the birth of the person who is being honored.",
        "A [______] is not necessarily a private occasion.",
        " Some parties are held in honor of a specific person, day, or event, such as a birthday [______], a Super Bowl [______], or a St.",
        "A [______] will often feature food and beverages, and generally conversation, music, dancing, or other forms of entertainment.",
        "A [______] is a gathering of people who have been invited by a host for the purposes of socializing, conversation, recreation, or as part of a festival or other commemoration or celebration of a special occasion."
    ],
    "DREAM": [
        "[______]work is similar, but does not seek to conclude with definite meaning.",
        "[______] interpretation, practiced by the Babylonians in the third millennium BCE and even earlier by the ancient Sumerians, figures prominently in religious texts in several traditions, and has played a lead role in psychotherapy.",
        "The content and function of [______]s have been topics of scientific, philosophical and religious interest throughout recorded history.",
        "Humans spend more than two hours [______]ing per night, and each [______] lasts around 5–20 minutes.",
        "A [______] is a succession of images, dynamic scenes and situations, ideas, emotions, and sensations that usually occur involuntarily in the mind during certain stages of sleep."
    ],
    "SLEEP": [
        "Although REM stands for \"rapid eye movement\", this mode of [______] has many other aspects, including virtual paralysis of the body.",
        "[______] occurs in repeating periods, during which the body alternates between two distinct modes: rapid eye movement [______] (REM) and non-REM [______].",
        "While [______] differs from wakefulness in terms of the ability to react to stimuli, it still involves active brain patterns, making it more reactive than a coma or disorders of consciousness.",
        "During [______], there is a marked decrease in muscle activity and interactions with the surrounding environment.",
        "[______] is a state of reduced mental and physical activity in which consciousness is altered and certain sensory activity is inhibited."
    ],
    "SOUND": [
        "[______] waves below 20 Hz are known as infra[______].",
        "[______] waves above 20 kHz are known as ultra[______] and are not audible to humans.",
        "In air at atmospheric pressure, these represent [______] waves with wavelengths of 17 meters (56 ft) to 1.7 centimeters (0.67 in).",
        "In human physiology and psychology, [______] is the reception of such waves and their perception by the brain.",
        "In physics, [______] is a vibration that propagates as an acoustic wave through a transmission medium such as a gas, liquid or solid."
    ],
    "POWER": [
        " Likewise, the [______] dissipated in an electrical element of a circuit is the product of the current flowing through the element and of the voltage across the element.",
        "The output [______] of a motor is the product of the torque that the motor generates and the angular velocity of its output shaft.",
        "[______] is a scalar quantity.",
        "In the International System of Units, the unit of [______] is the watt, equal to one joule per second.",
        "[______] is the amount of energy transferred or converted per unit time."
    ],
    "MONEY": [
        "Bank [______], whose value exists on the books of financial institutions and can be converted into physical notes or used for cashless payment, forms by far the largest part of broad [______] in developed countries.",
        "The [______] supply of a country comprises all currency in circulation (banknotes and coins currently issued) and, depending on the particular definition used, one or more types of bank [______] (the balances held in checking accounts, savings accounts, and other types of bank accounts).",
        "[______] was historically an emergent market phenomenon that possessed intrinsic value as a commodity; nearly all contemporary [______] systems are based on unbacked fiat [______] without use value.",
        "The primary functions which distinguish [______] are: medium of exchange, a unit of account, a store of value and sometimes, a standard of deferred payment.",
        "[______] is any item or verifiable record that is generally accepted as payment for goods and services and repayment of debts, such as taxes, in a particular country or socio-economic context."
    ],
    "COLOR": [
        "[______]s have perceived properties such as hue, [______]fulness, and lightness.",
        "Animal perception of [______] originates from different light wavelength or spectral sensitivity in cone cell types, which is then processed by the brain.",
        "Other animals may have a different number of cone cell types or have eyes sensitive to different wavelengths, such as bees that can distinguish ultraviolet, and thus have a different [______] sensitivity range.",
        "Though [______] is not an inherent property of matter, [______] perception is related to an object's light absorption, emission, reflection and transmission.",
        "[______] (or colour in Commonwealth English) is the visual perception produced by the activation of the different types of cone cells in the eye caused by light."
    ],
    "MAGIC": [
        "(𐎶𐎦𐎢𐏁|𐎶𐎦𐎢𐏁, [______]ian).",
        "  == Etymology ==  The English words [______], mage and [______]ian come from the Latin term magus, through the Greek μάγος, which is from the Old Persian maguš.",
        "During the late nineteenth and early twentieth centuries, Western intellectuals perceived the practice of [______] to be a sign of a fantasy-prone mentality and also commonly attributed it to marginalised groups of people.",
        "Within Western culture, [______] has been linked to ideas of the Other, foreignness, and primitivism; indicating that it is \"a powerful marker of cultural difference\" and likewise, a non-modern phenomenon.",
        "[______], sometimes spelled [______]k, is the application of beliefs, rituals or actions employed with the intent to manipulate natural or supernatural beings and forces."
    ],
    "GHOST": [
        "The overwhelming consensus of science is that there is no proof that [______]s exist.",
        "According to a 2009 study by the Pew Research Center, 18% of Americans say they have seen a [______].",
        "[______]s are generally described as solitary, human-like essences, though stories of [______]ly armies and the [______]s of animals other than humans have also been recounted.",
        "In [______]lore, descriptions of [______]s vary widely, from an invisible presence to translucent or barely visible wispy shapes to realistic, lifelike forms, whether they resemble humans or animnals.",
        "In folklore, a [______] is the soul or spirit of a dead person or non-human animal that is believed by some people to be able to appear to the living."
    ],
    "ANGEL": [
        "However, [______]ic beings might be conceived as aid to achieve a proper relationship with the divine.",
        "[______]s play a lesser role in monistic belief-systems, since the gap is non-existent.",
        " Emphasizing the distance between God and mankind, revelation-based belief-systems require [______]s to bridge the gap between the earthly and the transcendent realm.",
        "Other roles include protectors and guides for humans, such as guardian [______]s and servants of God.",
        "An [______] is a spiritual heavenly, or supernatural entity, usually humanoid with bird-like wings, often depicted as a messenger or intermediary between God (the transcendent) and humanity (the profane) in various traditions like the Abrahamic religions."
    ],
    "DEVIL": [
        "The word [______] in today's Farsi is pronounced as dev or div.",
        "  == Etymology == The Modern English word [______] derives from the Middle English devel, from the Old English dēofol, that in turn represents an early Germanic borrowing of the Latin diabolus.",
        "Each tradition, culture, and religion with a [______] in its mythos offers a different lens on manifestations of evil.",
        "Jeffrey Burton Russell states that the different conceptions of the [______] can be summed up as 1) a principle of evil independent from God, 2) an aspect of God, 3) a created being turning evil (a fallen angel) or 4) a symbol of human evil.",
        "A [______] is the mythical personification of evil as it is conceived in various cultures and religious traditions."
    ],
    "GIANT": [
        "  == Literary and cultural analysis == [______]s appear many times in folklore and myths.",
        "In more recent portrayals, like those of Jonathan Swift and Roald Dahl, some [______]s are both intelligent and friendly.",
        " Fairy tales such as Jack the [______] Killer have formed the modern perception of [______]s as dimwitted and violent ogres, sometimes said to eat humans or livestock.",
        "The word [______] is first attested in 1297 from Robert of Gloucester's chronicle.",
        "In folklore, [______]s (from Ancient Greek: gigas, cognate giga-) are beings of humanoid appearance, but are at times prodigious in size and strength or bear an otherwise notable appearance."
    ],
    "LOGIC": [
        "Informal [______] examines arguments expressed in natural language whereas formal [______] uses formal language.",
        "Informal [______] is associated with informal fallacies, critical thinking, and argumentation theory.",
        "Formal [______] is the study of deductively valid inferences or [______]al truths.",
        "It includes both formal and informal [______].",
        "[______] is the study of correct reasoning."
    ],
    "MATHS": [
        "Although [______]ematics is extensively used for modeling phenomena, the fundamental truths of [______]ematics are independent of any scientific experimentation.",
        "[______]ematics is essential in the natural sciences, engineering, medicine, finance, computer science, and the social sciences.",
        " [______]ematics uses pure reason to prove the properties of objects through proofs, which consist of a succession of applications of deductive rules to already established results.",
        "[______]ematics involves the description and manipulation of abstract objects that consist of either abstractions from nature or—in modern [______]ematics—purely abstract entities that are stipulated to have certain properties, called axioms.",
        "[______]ematics is a field of study that discovers and organizes methods, theories, and theorems that are developed and proved for the needs of empirical sciences and [______]ematics itself."
    ],
    "PEACE": [
        "As such, a universal definition for [______] does not concretely exist but gets expanded and defined proactively based on context and culture, in which it can serve many meanings not particularly benevolent in its symbolism.",
        "The representation of [______] has taken many shapes, with a variety of symbols pertaining to it based on culture, context, and history; each with their respective symbolism whose nature can be very complex.",
        " Promotion of [______] is a core tenet of many philosophies, religions, and ideologies, many of which consider it a core tenet of their philosophy.",
        "In a societal sense, [______] is commonly used to mean a lack of conflict (such as war) and freedom from fear of violence between individuals or groups.",
        "[______] is a state of harmony in the absence of hostility and violence."
    ],
    "TRUTH": [
        "This is called the correspondence theory of [______].",
        "Most commonly, [______] is viewed as the correspondence of language or thought to a mind-independent world.",
        "Some philosophers view the concept of [______] as basic, and unable to be explained in any terms that are more easily understood than the concept of [______] itself.",
        "The concept of [______] is discussed and debated in various contexts, including philosophy, art, theology, law, and science.",
        "[______] or verity is the property of being in accord with fact or reality."
    ],
    "VALUE": [
        "An object with \"ethic [______]\" may be termed an \"ethic or philosophic good\" (noun sense).",
        "What makes an action valuable may in turn depend on the ethical [______]s of the objects it increases, decreases, or alters.",
        "Often primary [______]s are strong and secondary [______]s are suitable for changes.",
        "[______] systems are proscriptive and prescriptive beliefs; they affect the ethical behavior of a person or are the basis of their intentional activities.",
        "In ethics and social sciences, [______] denotes the degree of importance of some thing or action, with the aim of determining which actions are best to do or what way is best to live (normative ethics), or to describe the significance of different actions."
    ],
    "YOUTH": [
        "[______] is an experience that may shape an individual's level of dependency, which can be marked in various ways according to different cultural perspectives.",
        "Its definitions of a specific age range varies, as [______] is not defined chronologically as a stage that can be tied to specific age ranges; nor can its end point be linked to specific activities, such as taking unpaid work, or having sexual relations.",
        "[______] is also defined as \"the appearance, freshness, vigor, spirit, etc., characteristic of one, who is young\".",
        "The word, [______], can also mean the time between childhood and adulthood (maturity), but it can also refer to one's peak, in terms of health or the period of life known as being a  young adult.",
        "[______] is the time of life when one is young."
    ],
    "ERROR": [
        "A 'mistake' is an [______] caused by a fault: the fault being misjudgment, carelessness, or forgetfulness.",
        "  == Human behavior == One reference differentiates between \"[______]\" and \"mistake\" as follows:  An '[______]' is a deviation from accuracy or correctness.",
        "An [______] could result in failure or in a deviation from the intended performance or behavior.",
        "In statistics, \"[______]\" refers to the difference between the value which has been computed and the correct value.",
        "An [______] (from the Latin errāre, meaning 'to wander') is an inaccurate or incorrect action, thought, or judgement."
    ]
}